k6_test/result.txt
execution: local
  script: create_menu_item.js
  output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

     ✗ item creation status is 201
      ↳  99% — ✓ 2884 / ✗ 20

     checks.........................: 99.31% ✓ 2884     ✗ 20  
     data_received..................: 1.2 MB 2.4 kB/s
     data_sent......................: 877 kB 1.7 kB/s
     http_req_blocked...............: avg=3.5ms    min=1µs      med=7µs      max=384.68ms p(90)=12µs     p(95)=14µs    
     http_req_connecting............: avg=3.48ms   min=0s       med=0s       max=347.65ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=445.42ms min=243.16ms med=251.85ms max=4m35s    p(90)=259.18ms p(95)=265.53ms
       { expected_response:true }...: avg=445.37ms min=247.25ms med=251.84ms max=4m35s    p(90)=258.91ms p(95)=265.05ms
     http_req_failed................: 0.68%  ✓ 20       ✗ 2884
     http_req_receiving.............: avg=359.66µs min=0s       med=76µs     max=26.65ms  p(90)=1.16ms   p(95)=1.68ms  
     http_req_sending...............: avg=40.13µs  min=7µs      med=33µs     max=1.85ms   p(90)=64µs     p(95)=72µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=445.02ms min=241.3ms  med=251.46ms max=4m35s    p(90)=258.64ms p(95)=265.04ms
     http_reqs......................: 2904   5.636031/s
     iteration_duration.............: avg=1.25s    min=244.14ms med=1.25s    max=1.97s    p(90)=1.26s    p(95)=1.27s   
     iterations.....................: 2904   5.636031/s
     vus............................: 1      min=1      max=20
     vus_max........................: 20     min=20     max=20


    running (8m35.3s), 00/20 VUs, 2904 complete and 0 interrupted iterations
    default ✓ [======================================] 00/20 VUs  4m0s


execution: local
    script: create_order.js
    output: -

     scenarios: (100.00%) 1 scenario, 2500 max VUs, 6m30s max duration (incl. graceful stop):
              * default: Up to 2500 looping VUs for 6m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

     ✗ order creation status is 201
      ↳  78% — ✓ 47888 / ✗ 13139

     checks.........................: 78.47% ✓ 47888      ✗ 13139 
     data_received..................: 54 MB  148 kB/s
     data_sent......................: 18 MB  48 kB/s
     http_req_blocked...............: avg=15.13ms min=1µs      med=7µs   max=4.02s  p(90)=12µs   p(95)=243.05ms
     http_req_connecting............: avg=15.11ms min=0s       med=0s    max=4.02s  p(90)=0s     p(95)=242.91ms
     http_req_duration..............: avg=6.01s   min=256.68ms med=2.29s max=1m0s   p(90)=10.24s p(95)=14.7s   
       { expected_response:true }...: avg=2.98s   min=256.68ms med=1.36s max=59.65s p(90)=5.93s  p(95)=8.98s   
     http_req_failed................: 21.52% ✓ 13139      ✗ 47888 
     http_req_receiving.............: avg=2.61ms  min=0s       med=450µs max=2.38s  p(90)=4.71ms p(95)=6.82ms  
     http_req_sending...............: avg=35.78µs min=5µs      med=31µs  max=5.98ms p(90)=48µs   p(95)=69µs    
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s    max=0s     p(90)=0s     p(95)=0s      
     http_req_waiting...............: avg=6s      min=256.53ms med=2.29s max=1m0s   p(90)=10.24s p(95)=14.7s   
     http_reqs......................: 61027  166.782394/s
     iteration_duration.............: avg=7.01s   min=1.25s    med=3.3s  max=1m1s   p(90)=11.25s p(95)=15.67s  
     iterations.....................: 61017  166.755065/s
     vus............................: 3      min=3        max=2500
     vus_max........................: 2500   min=2500     max=2500


    running (6m05.9s), 0000/2500 VUs, 61017 complete and 211 interrupted iterations
    default ✓ [======================================] 0000/2500 VUs  6m0s


execution: local
  script: get_menu_item.js
  output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

     execution: local
        script: get_menu_item.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 7m30s max duration (incl. graceful stop):
              * default: Up to 150 looping VUs for 7m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     ✗ status is 200
      ↳  99% — ✓ 2596 / ✗ 1
     ✗ response time is < 1000ms
      ↳  99% — ✓ 2544 / ✗ 52

     checks.........................: 98.98% ✓ 2596     ✗ 52 
     data_received..................: 1.6 GB 3.8 MB/s
     data_sent......................: 421 kB 998 B/s
     http_req_blocked...............: avg=15.7ms  min=2µs      med=10µs   max=1.24s  p(90)=16µs   p(95)=244.18ms
     http_req_connecting............: avg=15.65ms min=0s       med=0s     max=1.24s  p(90)=0s     p(95)=244.05ms
     http_req_duration..............: avg=12.37s  min=854.84ms med=13.04s max=29.38s p(90)=20.71s p(95)=21.91s  
       { expected_response:true }...: avg=12.37s  min=854.84ms med=13.04s max=29.38s p(90)=20.71s p(95)=21.91s  
     http_req_failed................: 0.03%  ✓ 1        ✗ 2596 
     http_req_receiving.............: avg=1.5s    min=112µs    med=1.34s  max=8.35s  p(90)=2.41s  p(95)=2.88s   
     http_req_sending...............: avg=48.84µs min=13µs     med=46µs   max=574µs  p(90)=66µs   p(95)=89µs    
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s     max=0s     p(90)=0s     p(95)=0s      
     http_req_waiting...............: avg=10.87s  min=316.34ms med=11.66s max=27.45s p(90)=19.3s  p(95)=20.42s  
     http_reqs......................: 2597   6.160416/s
     iteration_duration.............: avg=13.39s  min=1.85s    med=14.04s max=30.38s p(90)=21.74s p(95)=22.92s  
     iterations.....................: 2597   6.160416/s
     vus............................: 1      min=1      max=150
     vus_max........................: 150    min=150    max=150


  running (7m01.6s), 000/150 VUs, 2597 complete and 0 interrupted iterations
  default ✓ [======================================] 000/150 VUs  7m0s


execution: local
  script: get_user_info.js
  output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 2000 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✗ status is 200
      ↳  91% — ✓ 64122 / ✗ 5929
     ✗ response time is < 1000ms
      ↳  52% — ✓ 37069 / ✗ 32982

     checks.........................: 72.22% ✓ 101191     ✗ 38911 
     data_received..................: 27 MB  111 kB/s
     data_sent......................: 11 MB  45 kB/s
     http_req_blocked...............: avg=7.82ms  min=0s       med=5µs      max=528.84ms p(90)=9µs    p(95)=12µs  
     http_req_connecting............: avg=7.81ms  min=0s       med=0s       max=528.72ms p(90)=0s     p(95)=0s    
     http_req_duration..............: avg=2.92s   min=244.19ms med=890.73ms max=1m0s     p(90)=9.55s  p(95)=10.24s
       { expected_response:true }...: avg=1.94s   min=244.19ms med=820.54ms max=59.94s   p(90)=3.97s  p(95)=7.85s 
     http_req_failed................: 8.46%  ✓ 5929       ✗ 64122 
     http_req_receiving.............: avg=1.48ms  min=0s       med=191µs    max=960.37ms p(90)=3.52ms p(95)=5.09ms
     http_req_sending...............: avg=22.93µs min=3µs      med=19µs     max=6.95ms   p(90)=30µs   p(95)=43µs  
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s       max=0s       p(90)=0s     p(95)=0s    
     http_req_waiting...............: avg=2.92s   min=244.12ms med=888.6ms  max=1m0s     p(90)=9.55s  p(95)=10.24s
     http_reqs......................: 70051  283.094222/s
     iteration_duration.............: avg=3.93s   min=1.24s    med=1.9s     max=1m1s     p(90)=10.55s p(95)=11.24s
     iterations.....................: 70047  283.078057/s
     vus............................: 2      min=2        max=1999
     vus_max........................: 2000   min=2000     max=2000


running (4m07.4s), 0000/2000 VUs, 70047 complete and 55 interrupted iterations
default ✓ [======================================] 0000/2000 VUs  4m0s

execution: local
  script: sign_up_and_delete_user.js
  output: -

     scenarios: (100.00%) 1 scenario, 2000 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 2000 looping VUs for 4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)